'''(ЕГКР-2025) В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и его маске. Широковещательным адресом называется специализированный адрес, в котором все младшие биты, соответствующие нулям в маске, равны 1. Сеть задана IP-адресом одного из входящих в неё узлов 11.92.135.56 и сетевой маской 255.224.0.0. Определите наибольший IP-адрес данной сети, который может быть присвоен компьютеру. В ответе укажите найденный IP-адрес без разделителей. Например, если бы найденный адрес был равен 111.22.3.44, то в ответе следовало бы записать 11122344.'''
from ipaddress import *

net = ip_network("11.92.135.56/255.224.0.0", 0)
print(net[-1])