'''
№ 21710 ЕГКР 19.04.25 (Уровень: Базовый)

На числовой прямой даны два отрезка: B = [36; 75] и C = [60; 110]. Укажите наименьшую возможную длину такого отрезка A, что логическое выражение
¬(x∈A)→((x∈B)≡(x∈C))
 истинно (т.е. принимает значение 1) при любом значении переменной х.'''
def f(x):
    b = 36 <= x <= 75
    c = 60 <= x <= 110
    a = a1 <= x <= a2
    return (not a) <= (b == c)
r = list()
d = [y for x in [36, 60, 75, 110] for y in[x, x+0.1, x-0.1]]
for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f(x) for x in d):
            r += [a2 -a1]
print(round(min(r)))