'''№ 6827 (Уровень: Средний)
(Д. Статный) На числовой прямой даны три отрезка: P = [257, 1000], Q = [5, 100] и R = [99, 258]. Какова наименьшая длина отрезка A, при котором формула
((x∈A)→(x∈R))∧(¬((x∈A)→(x∈P))→(x∈Q))
тождественно истинна, то есть принимает значение 1 при любом значении переменной х?'''
def f (x):
    p = 257 <= x <= 1000
    q = 5 <= x <= 100
    r = 99 <= x <= 258
    a = a1 <= x <= a2
    return (a <= r) and ((not(a <= p)) <= q)
r = list()
d = [y for x in [5, 99, 100, 257, 258, 1000] for y in [x, x+0.1, x-0.1]]
for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f(x) for x in d):
            r = [a2 - a1]
print(round(min(r)))