'''	
№ 23743 Демоверсия 2026 (Уровень: Базовый)

Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и направление его движения. У исполнителя существует 5 команд: Поднять хвост, означающая переход к перемещению без рисования; Опустить хвост, означающая переход в режим рисования; Вперёд n (где n  –  целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова; Назад n (где n  –  целое число), вызывающая передвижение в противоположном голове направлении; Направо m (где m  –  целое число), вызывающая изменение направления движения на m градусов по часовой стрелке, Налево m (где m  –  целое число), вызывающая изменение направления движения на m градусов против часовой стрелки.

Запись Повтори k [Команда1 Команда2 … КомандаS] означает, что последовательность из S команд повторится k раз.

Черепахе был дан для исполнения следующий алгоритм.
Повтори 2 [Вперёд 14 Налево 270 Назад 12 Направо 90]
Поднять хвост
Вперёд 9 Направо 90 Назад 7 Налево 90
Опустить хвост
Повтори 2 [Вперёд 13 Направо 90 Вперёд 6 Направо 90]

Определите, сколько точек с целочисленными координатами находятся внутри объединения фигур, ограниченного заданными алгоритмом линиями, включая точки на линиях.
'''
from turtle import *

m = 15 #масштаб
tracer(0) #мнгновенная отрисовка
screensize (10000, 10000) #размер окна
#алгоритм черепашки
for i in range(2):
	fd(14*m)
	lt(270)
	bk(12*m)
	rt(90)
	
up()
fd(9*m)
rt(90)
bk(7*m)
lt(90)
down()

for i in range(2):
	fd(13*m)
	rt(90)
	fd(6*m)
	rt(90)

up() #убираем лишние линии
#рисуем координатную плоскость
for x in range(-20, 20):
	for y in range(-20, 20):
		goto(x*m, y*m)
		dot(3, "red")
		
update() #проявляем рисунок
exitonclick() #выход из рисунка по клику