'''(Р. Косов) Алгоритм вычисления функций F(n) и G(n), где n – целое число, задан следующими соотношениями:

F(n) = F(n – 4) + 3020, если n > 40;
F(n) = 3 · (G(n – 2) – 15), если n ≤ 40;
G(n) = 10 · n + 50, если n ≥ 301208;
G(n) = G(n + 7) – 21, если n < 301208.

Чему равно значение F(2026)?'''
g = {}
f = {}
for n in range(302000, -1, -1):
    if n >=  301208:
        g[n] = 10 * n + 50
    else:
        g[n] = g[n+7] - 21

for n in range(2, 2027):
    if n>40:
        f[n] = f[n-4] + 3020
    else:
        f[n] = 3 * (g[n-2] - 15)

print(f[2026])